Revit 2026 API

# PlasticVinylPlasticvinylBump Property

---

The property labeled "Finish Bumps" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylBump { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylBump As String
	Get
```
```cpp
public:
static property String^ PlasticvinylBump {
	String^ get ();
}
```
```fsharp
static member PlasticvinylBump : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylBumpType".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace